spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_with_the_amount.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_103rpP27wYrAQOnHaM5w2erQ
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_8jk8sTXoqM02bOvJTY8xX3jN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.10.1","lang":"ruby","lang_version":"2.0.0 p353 (2013-11-22)","platform":"x86_64-darwin12.4.0","publisher":"stripe","uname":"Darwin
        unknown002608df9b48 12.4.0 Darwin Kernel Version 12.4.0: Wed May  1 17:57:12
        PDT 2013; root:xnu-2050.24.15~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 17 Apr 2014 03:22:12 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1456'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_103rpP27wYrAQOnHaM5w2erQ",
          "created": 1397703584,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_103rpP27wYrAQOnHV9wI5USC",
              "object": "charge",
              "created": 1397703584,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "card": {
                "id": "card_103rpP27wYrAQOnHGtVqKqtK",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 4,
                "exp_year": 2017,
                "fingerprint": "v5aIbtpRE6eDf9H7",
                "customer": "cus_3rpPs9u5lEgj71",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              },
              "captured": true,
              "refunds": [],
              "balance_transaction": "txn_103rpP27wYrAQOnHwr8RYbmo",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_3rpPs9u5lEgj71",
              "invoice": "in_103rpP27wYrAQOnHLtgNIGIE",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_description": null
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_3rpPtXGAnEa28N"
        }
    http_version: 
  recorded_at: Thu, 17 Apr 2014 03:22:11 GMT
recorded_with: VCR 2.9.0
